[
  {
    "question": "Upload a snapshot of the inside of your fridge!",
    "type": "DARE"
  },
  {
    "question": "Grab something in the room you're currently in and spend 30 seconds on a video telling us about it. Get inventive if you have to... lol",
    "type": "DARE"
  },
  {
    "question": "IF YOU HAVE TATTOOS, show us some of your best ones! (upload a photo)",
    "type": "DARE"
  },
  {
    "question": "We want to see an pic inside your vehicle... pic or video, your choice....",
    "type": "DARE"
  },
  {
    "question": "Type to us your last text received, DO NOT INCLUDE NAMES/NICKS OR ANY IDENTIFYING INFORMATION. If people will easily guess who it is, do not use that text, skip to another...",
    "type": "DARE"
  },
  {
    "question": "Give us a picture of the inside of your food cupboard. ;)",
    "type": "DARE"
  },
  {
    "question": "In your sexiest voice, record 5 sentences of any material you like... doens't have to be sexy but you have to make it sound sexy! ;) lolll",
    "type": "DARE"
  },
  {
    "question": "Post your favourite LOVE SONG to #music and dedicate it to one person in the group IF you are really daring (this part optional.) ;)",
    "type": "DARE"
  },
  {
    "question": "Dare: Eat a spoon full of peanut butter (or other sticky substance).",
    "type": "DARE"
  },
  {
    "question": "Show us your destop screen (no sanitizing it or straightening it up ahead of time) .... :)",
    "type": "DARE"
  },
  {
    "question": "Take and post a selfie in #selfie-central",
    "type": "DARE"
  },
  {
    "question": "I dare you to write out a message to one of our group members and post a pic of it here! lol",
    "type": "DARE"
  },
  {
    "question": "Pick up the nearest book or magazine and read us 3 sentences on mic (you'll need to do this on your phone to access the mic.)",
    "type": "DARE"
  },
  {
    "question": "If your crush has the role “DMs Open” message them. If they don't have the role. Emote on two of their most recent comments.",
    "type": "DARE"
  },
  {
    "question": "Open up Spotify and take a screenshot to show your type of music",
    "type": "DARE"
  },
  {
    "question": "Get on MIC and read us your favourite LOVE poem or lyrics. If you're extra courageous, dedicate it to someone on this Discord. ;)",
    "type": "DARE"
  },
  {
    "question": "Do a 1 minute video for the Discord and upload it. Your choice of subject and you don't have to be on cam. Just keep it PG13! :)",
    "type": "DARE"
  },
  {
    "question": "We dare you to post a pic of your bedroom to the channel! :)",
    "type": "DARE"
  },
  {
    "question": "Step outside your home/office and take either a picture or video of what is outside and upload it. :)",
    "type": "DARE"
  },
  {
    "question": "Show us some of your favourite cooking devices in either pics or a video. ;)",
    "type": "DARE"
  },
  {
    "question": "WITHOUT MAKING ANY CHANGES FIRST, show us your phone's homescreen....",
    "type": "DARE"
  },
  {
    "question": "Dare: Go outside and take 5 big breathes. Side quest if you're brave, touch grass.",
    "type": "DARE"
  }
]