[
  {
    "question": "What makes you a great partner?",
    "type": "TRUTH"
  },
  {
    "question": "What is your favorite season of the year? Why do you like it?",
    "type": "TRUTH"
  },
  {
    "question": "Who's someone you'll always carry in your heart, and what's the biggest lesson they taught you?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever listened to WoW music (songs written and sung by WoW players and posted on YT...usually parodies)? If so, do you like them and do you have any favourites? Post them in ⁠unknown :)",
    "type": "TRUTH"
  },
  {
    "question": "The world is about to have a zombie apocalypse and you can choose up to 5 members from this discord to be part of your survival party. Who do you choose (and feel free to say why you chose them)?",
    "type": "TRUTH"
  },
  {
    "question": "When the game of life is over, what is it you would most want to be remembered for? Do you think that how you are living now will cause people to remember you how you want to be remembered?",
    "type": "TRUTH"
  },
  {
    "question": "Let's say you were dating a WOW gamer. Would you want them to be a member of your guild or not? Tell us why. ;)",
    "type": "TRUTH"
  },
  {
    "question": "Are you much of a reader? What types of books interest you? What is the size of your book collection (paper or digital)? Feel free to share a bookcover or two of the types of books you read.",
    "type": "TRUTH"
  },
  {
    "question": "Would it bother you if your partner watches porno? If you answer no, is there a point where it might it bother you??",
    "type": "TRUTH"
  },
  {
    "question": "Describe to us the best date you ever had. If you never had a great date, describe to us what a great date would look like to you! :)",
    "type": "TRUTH"
  },
  {
    "question": "What do you think is your biggest flaw?",
    "type": "TRUTH"
  },
  {
    "question": "What is your favourite colour? Be specific",
    "type": "TRUTH"
  },
  {
    "question": "How much do you like spooning with your partner on a scale of 1 to 10 (1 being not at all, 10 being you love it.) Tell us the truth, no trying to impress. ;)",
    "type": "TRUTH"
  },
  {
    "question": "Do you believe in unconditional love?",
    "type": "TRUTH"
  },
  {
    "question": "How do you like to recharge your energy?",
    "type": "TRUTH"
  },
  {
    "question": "How important is it to you that your partner is a decent cook?",
    "type": "TRUTH"
  },
  {
    "question": "What makes you feel most alive?",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer short hair or long hair on your partner or just want them to have ANY hair? lol Please tell us your honest preference.",
    "type": "TRUTH"
  },
  {
    "question": "'what was your first character, and why did you make it? Do you identify yourself with it?'",
    "type": "TRUTH"
  },
  {
    "question": "What part of your sexuality do you still not understand and why do you think that is?",
    "type": "TRUTH"
  },
  {
    "question": "How long have you played WoW and what keeps you coming back?",
    "type": "TRUTH"
  },
  {
    "question": "Do you usually follow your head or your heart?",
    "type": "TRUTH"
  },
  {
    "question": "What is your dream job? Do you do that for work, why or why not?",
    "type": "TRUTH"
  },
  {
    "question": "Hypothetical Situation: You find out your lover has been self-pleasuring instead of having sex with you. How would you feel? How would you handle it? (No pun intended. lol)",
    "type": "TRUTH"
  },
  {
    "question": "How important is loyalty to you when it comes to a romantic partner? Secondly, what would loyalty LOOK LIKE to you? Give us some examples!",
    "type": "TRUTH"
  },
  {
    "question": "Would you consider a long-distance relationship and, if so, what conditions would you set?",
    "type": "TRUTH"
  },
  {
    "question": "What is something that gives you the “ick” in a new relationship? Would it be deal breaking?",
    "type": "TRUTH"
  },
  {
    "question": "Do you smoke either cigarettes or MJ? Let's say you were dating someone who would get headaches or congestion when you smoked around them. Would you care? If so, what would you do?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever had a threesome and if so, any regrets? Would you do it again?",
    "type": "TRUTH"
  },
  {
    "question": "Tell us truthfully, do you like being spoiled and fussed over by your lover? NO FIBBING :P lol",
    "type": "TRUTH"
  },
  {
    "question": "You're getting married. Would you rather have a big, fancy wedding and spend a big chunk of money (how much would you be willing to spend?) OR what would your plan be if your answer is no?",
    "type": "TRUTH"
  },
  {
    "question": "You're in love. You get married. Then your wife/husband demands you quit gaming and does not want to compromise. What do you do?",
    "type": "TRUTH"
  },
  {
    "question": "Do you fall in love easily?",
    "type": "TRUTH"
  },
  {
    "question": "What's something you've forgiven someone for, even though they may not know?",
    "type": "TRUTH"
  },
  {
    "question": "If you could go back and have a do-over when it comes to education/training and career/job choices, what would you choose to do (let's pretend money is not a factor)?",
    "type": "TRUTH"
  },
  {
    "question": "What is the worst experience you've ever had from online dating (as in a date or meeting, not a relationship)?",
    "type": "TRUTH"
  },
  {
    "question": "Do you suffer much aggro from anyone for your gaming activities? Do you hide your gaming activities from anyone?",
    "type": "TRUTH"
  },
  {
    "question": "Kenion would like to know if you have played on a private server? ;) If so, tell us which one and would you recommend it or not and why?",
    "type": "TRUTH"
  },
  {
    "question": "If you have a committed partner, how often would 1)you like to have sex ideally and 2) if you can't get that, what do you consider the minimum amount to keep you sexually satisfied?",
    "type": "TRUTH"
  },
  {
    "question": "Think about this. What is the top thing you look for in a dating partner vs. the top thing you look for in someone you'd actually marry and settle down with?",
    "type": "TRUTH"
  },
  {
    "question": "Sex or bacon?",
    "type": "TRUTH"
  },
  {
    "question": "Is it ok to flirt privately with others (DM's, social media, etc.) when you have a girlfriend/boyfriend and have you done it? If so, do you regret it now?",
    "type": "TRUTH"
  },
  {
    "question": "Do you have \"one that got away\" and do you still think about them and maybe wish things had ended differently? Or, are you at peace with how things ended?",
    "type": "TRUTH"
  },
  {
    "question": "What's a time in your life you wish you could relive, even if just for a few minutes?",
    "type": "TRUTH"
  },
  {
    "question": "What is one thing from your bucket list?",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer a potential love interest to be bold about approaching you or do you prefer a subdued approach? Lastly, if you are female, do you ever ask men out yourself?",
    "type": "TRUTH"
  },
  {
    "question": "What is one thing that you've always wanted to cross off your bucket list?",
    "type": "TRUTH"
  },
  {
    "question": "WITHOUT BASHING EITHER SEX, what's your take on the dating world of today? If you could be born at any time, what era would you prefer when it comes to dating/mating? :)",
    "type": "TRUTH"
  },
  {
    "question": "Could you realistically ever see yourself living a polyamorous lifestyle (more than one partner)? Why or why not?",
    "type": "TRUTH"
  },
  {
    "question": "Are you a music lover? How much do you listen to music and what kinds of music do you usually listen to? NO MUSIC VIDS HERE please but you can feel free to post a sample in the ⁠music channel. :)",
    "type": "TRUTH"
  },
  {
    "question": "When it comes to falling in love, do you prefer to first build a solid frienship before entertaining more or do you tend to go all in from the outset?",
    "type": "TRUTH"
  },
  {
    "question": "How affectionate are you with a lover?",
    "type": "TRUTH"
  },
  {
    "question": "What's holding you back from being the best version of yourself?",
    "type": "TRUTH"
  },
  {
    "question": "Pick someone on this Discord you like/think highly of and tell us what you admire or like about this person (does not have to indicate romantic attraction, just something about them you like or respect.) :)",
    "type": "TRUTH"
  },
  {
    "question": "Would you be initiating hanky panky at the drive-in or not? How far would it go if it was up to you (no need to be graphic)? :)",
    "type": "TRUTH"
  },
  {
    "question": "Whats the most excited you've ever been with your clothes on? (not a sexual question lol)",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever been stalked in person or online? (Feel free to give details but you don't have to.) How did it end? Has it made you extra cautious now?",
    "type": "TRUTH"
  },
  {
    "question": "Do you fall for the fake accessories popular today (fake eyelashes, nails, wigs, lips, silicone boobs and butt, etc.)? If so, would you want your wife sporting them too? Be honest!",
    "type": "TRUTH"
  },
  {
    "question": "What does being in love feel like to you?",
    "type": "TRUTH"
  },
  {
    "question": "How important are sports to you and is it important that a significant other enjoy the same sports, maybe even support the same teams? Are you a mega diehard fan of any team??",
    "type": "TRUTH"
  },
  {
    "question": "What would you never do in game for yourself but you would do for a romantic interest who asked you to? (Think of stuff you normally hate but would do for them..) ;)",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever been in a physical fight over someone you liked/loved? Give us the tea.... If not, do you think it ever could happen and what would drive you to it?",
    "type": "TRUTH"
  },
  {
    "question": "Do you acknowledge that bad relationships are seldom the fault of only one partner? What have you done/not done in a past relationship that you realized you needed to change or improve on and have you improved?",
    "type": "TRUTH"
  },
  {
    "question": "Let's say you're in a close friendship/relationship that doesn't end well. Are you the type who will tell that person's secrets after the breakup or are you the type who will still keep their secrets?",
    "type": "TRUTH"
  },
  {
    "question": "What kind of surprises are you delighted by?",
    "type": "TRUTH"
  },
  {
    "question": "Do you ever wander around your house or apartment in the nude? Do you first make sure to shut your drapes/blinds? ;)",
    "type": "TRUTH"
  },
  {
    "question": "What's a moment in your life you wish you could have shared with someone who's no longer here?",
    "type": "TRUTH"
  },
  {
    "question": "What's one thing you wish people could understand about you better?",
    "type": "TRUTH"
  },
  {
    "question": "What's a memory you go back to when you need comfort?",
    "type": "TRUTH"
  },
  {
    "question": "What's something you don't talk about much but think about almost every day?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever had a really toxic relationship and if so, what was the breaking point that caused it to end? Has it changed you? What would you do if a new relationship started proving toxic?",
    "type": "TRUTH"
  },
  {
    "question": "What is the most romantic place in Azeroth to take your date to?",
    "type": "TRUTH"
  },
  {
    "question": "What song best describes the last 2 years of your life? Why?",
    "type": "TRUTH"
  },
  {
    "question": "Do you ever wish you were born in another time? Why and what time period would you rather have been born in? BONUS: And in what country/area?",
    "type": "TRUTH"
  },
  {
    "question": "What's one thing you've always wanted to do, but something has held you back?",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer a lover who is shorter or taller than you and why? (Optional: Tell us how tall you are and what height range you usually prefer in a lover.)",
    "type": "TRUTH"
  },
  {
    "question": "If a tragedy struck. (Fire, earth quake, flood, etc.) What would you grab out of your house first, and why?",
    "type": "TRUTH"
  },
  {
    "question": "Are you an RP'er in the game? If not, would you like to try it? Also, would you be interested in an RP channel on this Discord?",
    "type": "TRUTH"
  },
  {
    "question": "How do you feel about tattoos on a partner? Do they turn you on (or off)? Do you have any limits as to how many or what type? Are there particular types you like? Lastly, how do you feel about getting tattoos yourself?",
    "type": "TRUTH"
  },
  {
    "question": "Do you ever check to see who your discord crush has liked in the selfies channel? BE HONEST. lol",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever dated a gamer and if so, how did it go? Pros? Cons?",
    "type": "TRUTH"
  },
  {
    "question": "If you're a guy, are you the type to hold doors open for women and offer to lend a hand when something heavy needs to be lifted, etc. If you're a woman, how do you feel about that and does it happen often for you or not? ;)",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever gone nude in public with body paint? If not, would you ever consider it? ;)",
    "type": "TRUTH"
  },
  {
    "question": "Does it bother you if your partner makes more money than you? What about less than you?",
    "type": "TRUTH"
  },
  {
    "question": "Would you date your friend's ex if you felt they were really the love of your life after getting to know them following the break-up?",
    "type": "TRUTH"
  },
  {
    "question": "What's the longest Discord convo you ever had?",
    "type": "TRUTH"
  },
  {
    "question": "On a scale of 1 to 10 (1 being not at all shy and 10 being extremely shy,) how shy are you?? Have you had problems making convo on this Discord due to shyness?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever forgotten a love interest's name? In game or out? Anyone forgotten yours? Does any of it apply to someone on this Discord? lol",
    "type": "TRUTH"
  },
  {
    "question": "Do you think Blizzard has put on a great WoW Anniversary celebration with all the events/prizes/activities? Anything you'd improve on?",
    "type": "TRUTH"
  },
  {
    "question": "Do you sometimes get jealous when you see your discord crush chatting or flirting with others? Also, does it affect your interest in interacting with them?",
    "type": "TRUTH"
  },
  {
    "question": "If you were to get married or in a serious relationship with someone, are you more the type that wants to spend a lot of time socializing with others or do you like private time with your partner more?",
    "type": "TRUTH"
  },
  {
    "question": "We're all going to a WOW Singles Discord Convention.... you have to choose a roommate from the Discord, who are your top 3 choices and why?",
    "type": "TRUTH"
  },
  {
    "question": "It's your RAID NIGHT with your guild but your girlfriend/boyfriend wants to have sex NOW. (lol) Are you choosing your raid group or your lover? (No compromise answers thank you, this is to put you on the spot priority-wise. lol) ;)",
    "type": "TRUTH"
  },
  {
    "question": "Without naming names, have you talked to anyone on this Discord that you really want to get to know better?",
    "type": "TRUTH"
  },
  {
    "question": "How important is to you that your partner have a matching sex drive? Have you experienced it before where they did not and did it cause problems?",
    "type": "TRUTH"
  },
  {
    "question": "When was the last time you truly felt at peace, even if it was just for a moment?",
    "type": "TRUTH"
  },
  {
    "question": "What can you do to make yourself a better person?",
    "type": "TRUTH"
  },
  {
    "question": "Your fave sport is on tv but your partner is feeling amorous.... which do you choose???",
    "type": "TRUTH"
  },
  {
    "question": "Take a moment here to think on this question. 1) What is the top thing that attracts you to a potential dating partner? 2) Now what is the top thing that would attract you to a marraige partner? Feel free to elaborate.",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever had anyone's name tattooed on you? If you haven't, what would it take to convince you to get it done??",
    "type": "TRUTH"
  },
  {
    "question": "If everyone in this discord was local to you, name some members who you could see yourself hanging out with and possibly being friends (or more)....",
    "type": "TRUTH"
  },
  {
    "question": "If you couldn't feel fear for a day, what would you do?",
    "type": "TRUTH"
  },
  {
    "question": "What's your idea of a perfect day?",
    "type": "TRUTH"
  },
  {
    "question": "Name up to 3 other countries you'd be interested in living in and tell us why. Also how long would you ideally live there or would you want it to be permanent?",
    "type": "TRUTH"
  },
  {
    "question": "Do you routinely wear underwear or do you prefer to \"go commando\" and why?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever had sex in a public setting? If so, where? Did you get caught? Give us the tea (but leave out any graphic details please.) ;)",
    "type": "TRUTH"
  },
  {
    "question": "What's one thing you wish you could tell your younger self?",
    "type": "TRUTH"
  },
  {
    "question": "You go to visit someone at their home. Are you someone who takes your shoes off at the door or not? Let us know where you are from when you answer. ;)",
    "type": "TRUTH"
  },
  {
    "question": "What do you find the hardest part about relationships? (Assume your partner has done nothing terrible to you when you answer this.)",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever gotten turned on while reading convos on this Discord? If no, how about in personal Discord conversations? ;) lol (Optional: Did anyone know you were?)",
    "type": "TRUTH"
  },
  {
    "question": "You have a fantastic lover. It's time to select a gift for Christmas. Let's pretend you have $100 to spend on the gift, what are the gift ideas that come to mind? This is a great opportunity to get feedback. ;)",
    "type": "TRUTH"
  },
  {
    "question": "On a scale of 1 to 10 (10 being ecstatically happy,) how happy are you on an average day lately? Feel free to share why you feel happy or unhappy (but that's optional.)",
    "type": "TRUTH"
  },
  {
    "question": "What did you learn from your last relationship?",
    "type": "TRUTH"
  },
  {
    "question": "Are you comfortable being vulnerable with a potential partner? If not, what would help you open up?",
    "type": "TRUTH"
  },
  {
    "question": "What is the funniest or most awkward date you've been on?",
    "type": "TRUTH"
  },
  {
    "question": "How do you feel about PDA (public displays of affection) with a lover? If you are fine with them, to what extent?",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer to sleep in the nude or do you have to wear something to bed? How would you feel if your new lover was the opposite of you in that respect?",
    "type": "TRUTH"
  },
  {
    "question": "What's the best piece of advice you've ever received about relationships?",
    "type": "TRUTH"
  },
  {
    "question": "How do you know when someone is compatible with you?",
    "type": "TRUTH"
  },
  {
    "question": "Tell us up to 3 celebrities who you find romantically appealing and why.....",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer to live in the country, the suburbs or right in the city?",
    "type": "TRUTH"
  },
  {
    "question": "What would you have to say if your romantic partner informed you they were going to get a Brazilian Butt Lift? Be honest. (I assume you've read the news stories on this procedure.)",
    "type": "TRUTH"
  },
  {
    "question": "How long have you played WoW and what is your favourite expansion to date? Also, are you enjoying the current expansion?",
    "type": "TRUTH"
  },
  {
    "question": "Are you comfortable showing your emotions or is it a struggle for you?",
    "type": "TRUTH"
  },
  {
    "question": "What's the bravest thing you've ever done?",
    "type": "TRUTH"
  },
  {
    "question": "What are you currently looking forward to?",
    "type": "TRUTH"
  },
  {
    "question": "What book/movie had the most significant impact on you?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever felt so out of control in some area of your life that maybe you needed an intervention? If so, in what area of life? Bonus: Who in our group would you want at the intervention? ;)",
    "type": "TRUTH"
  },
  {
    "question": "Would you like your partner to sport different wigs to keep things interesting and perhaps keep you guessing what you're coming home to? ;) lol",
    "type": "TRUTH"
  },
  {
    "question": "If you could choose one person to hear “I'm so proud of you” from, who would it be and why?",
    "type": "TRUTH"
  },
  {
    "question": "What's a song or a place that instantly brings you back to a special moment?",
    "type": "TRUTH"
  },
  {
    "question": "How much time do you spend playing WOW in an average week? Do you feel you should be playing less or more? And does anyone complain to you about your WOW time?",
    "type": "TRUTH"
  },
  {
    "question": "What WoW expansion was your least favourite and why?",
    "type": "TRUTH"
  },
  {
    "question": "If you could bottle up one feeling and keep it with you forever, what would it be?",
    "type": "TRUTH"
  },
  {
    "question": "How important is it to you that you date/marry a gamer? If so, how important is it to you that they be equally skilled?",
    "type": "TRUTH"
  },
  {
    "question": "If you could look into the future, what would you want to know?",
    "type": "TRUTH"
  },
  {
    "question": "You're walking down a very busy street (with a lot of traffic) with your bf/gf... Do you tend to walk next to the road or on the inside and why? ;)",
    "type": "TRUTH"
  },
  {
    "question": "If you could relive a day from your past, without changing anything, which day would it be?",
    "type": "TRUTH"
  },
  {
    "question": "Would you rather marry someone from your own country or does a foreigner hold more appeal for you? Why?",
    "type": "TRUTH"
  },
  {
    "question": "IF there was a WOW Singles Discord Meeting in a town/city near you, would you likely attend??? Anyone in particular from the group you'd hope to meet there (list as many as you want...)",
    "type": "TRUTH"
  },
  {
    "question": "What do you do for work? (Please give vague titles. NO SPECIFICS like x Panda Express in y city, or NYPD.) And do you enjoy it, why or why not?",
    "type": "TRUTH"
  },
  {
    "question": "Do you have any hobby or special interest that you think would be a surprise to others? If so, tell us about it, how you got into it and how you enjoy it... :)",
    "type": "TRUTH"
  },
  {
    "question": "What's the best piece of advice you've ever received?",
    "type": "TRUTH"
  },
  {
    "question": "Tell us, if you would, some of your dealbreakers when it comes to deciding on whether to date someone... what would cause you to decline dating them?",
    "type": "TRUTH"
  },
  {
    "question": "You're in group with your romantic interest and another player is being rude to them. Would that upset you and if so, how much? What would you do? Anything?",
    "type": "TRUTH"
  },
  {
    "question": "Do you have any children? If not, do you want to have children and how many if you do. Also, how do you feel about dating others with children?",
    "type": "TRUTH"
  },
  {
    "question": "Who made you feel the most welcome when you joined this Discord and why? :)",
    "type": "TRUTH"
  },
  {
    "question": "What would the happiest version of yourself prioritize this week?",
    "type": "TRUTH"
  },
  {
    "question": "If someone from this discord asked to get to know you better, would you let them? Why or why not?",
    "type": "TRUTH"
  },
  {
    "question": "How do you think dating apps and websites have affected your dating life? Do you like them or not?",
    "type": "TRUTH"
  },
  {
    "question": "Do any dungeons or raids have a special meaning for you, if so why?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever found yourself in a relationship you wanted to get out of? What did you? If you broke it off, how did you do it and would you do it differently now, looking back?",
    "type": "TRUTH"
  },
  {
    "question": "Do you feel lonely when playing WOW?",
    "type": "TRUTH"
  },
  {
    "question": "What is the biggest lie you were told as a child?",
    "type": "TRUTH"
  },
  {
    "question": "If you could go back in time and say something to your younger self, what would you say?",
    "type": "TRUTH"
  },
  {
    "question": "Who do you think should pay for a date? Do tell! ;)",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer to have a lot of alone time when in a relationship or do you enjoy being with your partner a lot?",
    "type": "TRUTH"
  },
  {
    "question": "Answer HONESTLY. How concerned are you with \"body count\" when it comes to a) a lover and b) the person you want to marry?",
    "type": "TRUTH"
  },
  {
    "question": "Have you made any friends on the WoW Singles Discord? If not yet, tell us about what kind of friendships you'd like to make.",
    "type": "TRUTH"
  },
  {
    "question": "Are you a dirty talker in bed (or would like to be but you're shy)? Be honest, maybe someone will offer to tutor you! ;) LOLLLL How dirty does it get on a scale of 1 to 10 (with 10 being the dirtiest.)",
    "type": "TRUTH"
  },
  {
    "question": "Do you think you treat yourself the same way you treat the people you love most?",
    "type": "TRUTH"
  },
  {
    "question": "Is there a particular WoW class that turns you on (as in for your love interest)? What about a WoW race?",
    "type": "TRUTH"
  },
  {
    "question": "If you met the right person and you felt serious about them, would you be open to relocating?",
    "type": "TRUTH"
  },
  {
    "question": "Tell us your middle name. (You can share your first name too if you care to but not expected...) Do you like your name?",
    "type": "TRUTH"
  },
  {
    "question": "If your life was a book, what would you name your current chapter?",
    "type": "TRUTH"
  },
  {
    "question": "Your romantic interest is in group with you when a RARE mount drops that you really want (and so does she.) BE HONEST.... The mount drops for you but you have the ability to pass it to someone else. Do you give it to her or keep it yourself? ;)",
    "type": "TRUTH"
  },
  {
    "question": "Your lover says they are \"kinky\".... What kind of kink is too much kink for you? ;) (Keep it PG-13 please!)",
    "type": "TRUTH"
  },
  {
    "question": "What are three qualities you think make a healthy relationship?",
    "type": "TRUTH"
  },
  {
    "question": "If you had a REDO, what would you change about your dating history??",
    "type": "TRUTH"
  },
  {
    "question": "You like someone who plays the same game you do. You aren't in the same guild though. How much do you go out of your way to include that person in your game activities? Give us some examples if you've done this before.",
    "type": "TRUTH"
  },
  {
    "question": "What's a promise you've made to yourself that you're still trying to keep?",
    "type": "TRUTH"
  },
  {
    "question": "Re your past relationships (online and offline,) do you talk about those people badly/bitterly or have you mostly come to terms with what happened and don't think they were all at fault/a bad person?",
    "type": "TRUTH"
  },
  {
    "question": "Have you taken the time to scroll back in this channel to see what other members have answered? If so, do you feel like you've learned some things about other members?",
    "type": "TRUTH"
  },
  {
    "question": "What's something that made you who you are, but you rarely tell anyone about?",
    "type": "TRUTH"
  },
  {
    "question": "What's the best compliment you've ever received?",
    "type": "TRUTH"
  },
  {
    "question": "What quality or trait have you had the hardest time finding in a partner?",
    "type": "TRUTH"
  },
  {
    "question": "What's your clothing style? Feel free to either describe it to us or show us a pic of what you like to wear.",
    "type": "TRUTH"
  },
  {
    "question": "Do you partake of any sexy reading materials? If so, share one of the titles and give us a plot summary....",
    "type": "TRUTH"
  },
  {
    "question": "Are you the kind of person who finds online relationships to be intense more quickly or is it only in-person relationships that do it for you in that sense?",
    "type": "TRUTH"
  },
  {
    "question": "What's your idea of a perfect weekend with a partner?",
    "type": "TRUTH"
  },
  {
    "question": "Do you consider yourself more of an introvert or extrovert? And if you could choose for yourself, which would you rather be and why?",
    "type": "TRUTH"
  },
  {
    "question": "Do you prefer natural or silicone breasts? Why?",
    "type": "TRUTH"
  },
  {
    "question": "Does it bother you at all if your lover swears? Feel free to talk about what kind of severity or frequency might begin to bother you.",
    "type": "TRUTH"
  },
  {
    "question": "What's your favorite quote?",
    "type": "TRUTH"
  },
  {
    "question": "On a scale of 1-10, how much do you love yourself? What needs to happen to increase that number?",
    "type": "TRUTH"
  },
  {
    "question": "Have you ever had 'digital sex' (phone/text/discord, etc. etc.)? Did you like it? Would you do it again??",
    "type": "TRUTH"
  },
  {
    "question": "What's one part of yourself that you've come to love only after many years?",
    "type": "TRUTH"
  },
  {
    "question": "Is there something you tend to take for granted? What can you do to change that?",
    "type": "TRUTH"
  },
  {
    "question": "Do you act your age?",
    "type": "TRUTH"
  }
]